Tekla Open API Reference for Tekla Structures 2025
AnalysisRestraints Properties
The AnalysisRestraints type exposes the following members.
Properties
Name | Description
End
 Data related to the second part end.
Start
 Data related to the first part end.
Top
See Also
Reference
AnalysisRestraints Class
Tekla.Structures.Analysis Namespace